#-----------------------------------------------------
# [실습1] 알고 싶은 단을 입력 받고 해당 단을 출력해주세요
# - input()
# - 특정 단의 구구단을 출력 => 반복문 사용하기
#-----------------------------------------------------

dan = input('단을 입력하세요')
# if dan:
#     if dan.isdecimal():
#         for i in range(1,10):
#             dan = int(dan)
#             print( f'{dan}단 : {dan}*{i} = {dan*i}')
#     else:
#         print("숫자만 입력 가능합니다.")
# else:
#     print("입력된 데이터가 없습니다.")

if dan.isdecimal():
    for i in range(2,10):    # 반대로 => range(9,0,-1)
        dan = int(dan)
        print( f'{dan}단 : {dan}*{i} = {dan*i}')
else:
    print("정확한 데이터가 아닙니다.")



#-----------------------------------------------------
# [실습2] 2단~9단까지 모두 출력 하세요. 반복문 사용하기!
# - 중첩 for 반복문
#-----------------------------------------------------
for dan in range(2,10):
    print(f'-----{dan}단-------')
    for i in range(1,10):
        print( f'{dan}*{i} = {dan*i}')


#-----------------------------------------------------
# [실습2] 2단~9단까지 모두 출력 하세요. 반복문 사용하기!
# - 중첩 for 반복문
#-----------------------------------------------------

for i in range(10):
    for dan in range(2,10):
        if i:
            print(f'{dan} * {i} = {dan * i:2}', end = '\n' if dan == 9 else "   ")
        else:                            ## 0<2 기본 두칸을 지정하고 오른정렬해라, 왼쪽에 비어있는 칸에는 0을 넣어라
            print(f'---{dan}단---', end = "\n" if dan == 9 else "  ")  ## i = 0일 때라고 생각

